package A_Java_ProgrammingBasics.Z_Exam;

import java.util.*;

public class E06 {

/* Най-малкият син на семейство Иванови все още не знае таблицата за умножение. Веднага след коледните празници, той ще има контролно и вие трябва да му помогнете да я научи.
Вашата задача е да съставите програма, в която се въвежда цяло трицифрено число и се извежда таблицата за умножение. Поради особености на Вашата програма,
тя взима цифрите на въведеното число в обратен ред. Максималната стойност на множителите е определена от всяка една от 3-те цифри на въведеното число.

Вход: Входът е цяло трицифрено число в интервала [111…999].

Да се отпечатат на конзолата няколко на брой реда в следния формат:
"{първата цифра} * {втората цифра} * {третата цифра} = {резултатът от умножението на трите цифри};"
Първата, втората и третата цифра не могат да бъдат отрицателни числа или равни на 0!
Най-малкият син на семейство Иванови все още не знае таблицата за умножение. Веднага след коледните празници, той ще има контролно и вие трябва да му помогнете да я научи.
Вашата задача е да съставите програма, в която се въвежда цяло трицифрено число и се извежда таблицата за умножение. Поради особености на Вашата програма,
тя взима цифрите на въведеното число в обратен ред. Максималната стойност на множителите е определена от всяка една от 3-те цифри на въведеното число. */


    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);

        int input = Integer.parseInt(scanner.nextLine());
        String number = String.valueOf(input);

        int d1 = Integer.parseInt(String.valueOf(number.charAt(2)));
        int d2 = Integer.parseInt(String.valueOf(number.charAt(1)));
        int d3 = Integer.parseInt(String.valueOf(number.charAt(0)));

        for (int m1 = 1; m1 <= d1; m1++) {
            for (int m2 = 1; m2 <= d2; m2++) {
                for (int m3 = 1; m3 <= d3; m3++) {
                    System.out.printf("%d * %d * %d = %d;\n", m1, m2, m3, m1 * m2 * m3);
                }
            }
        }
    }
}